posts/coming-to-terms-with-the-pace-of-change-in-r.org
#+BEGIN_COMMENT
.. title: Coming to terms with the pace of change in R
.. slug: coming-to-terms-with-the-pace-of-change-in-r
.. date: 2016-09-20 09:58:33 UTC-04:00
.. tags: R
.. category: R
.. link: 
.. description: R is changing rapidly and for the better. Keeping up is worth it.  
.. type: text
#+END_COMMENT

#+PROPERTY: cache no
#+PROPERTY: results output
#+PROPERTY: session *R*
#+PROPERTY: exports both
#+PROPERTY: tangle R_windows_encoding.R


* Is it you or have I become old and cranky?
I've been using R and mostly enjoying it since 2006. Lately I've been having some misgivings about the direction R as a community is headed. Some of these misgivings no doubt stem from reluctance to learn new ways of doing things after investing so much time mastering the old ways, but underneath my old-man crankiness I believe there are real and important challenges facing the R community. R has grown considerably since I started using it a decade ago, and this has mostly been a good thing as new packages implement new and better functionality. Recently, popular contributed packages have been replacing core R functionality with new approaches, leading to a fragmentation of the user base and increasing cognitive load by requiring analysts to choose a package (or set of packages) before they even write the first line of code.

#+HTML: <!-- TEASER_END -->

* R is "a large, coherent, integrated collection of intermediate tools for data analysis"
The quote is taken from the official R manual [[https://cran.r-project.org/doc/manuals/R-intro.html#Introduction-and-preliminaries][An Introduction to R]]. The "coherent" and "integrated" claims have always been questionable in some areas, but this situation is getting far worse as contributed packages re-invent basic R features and replace classic R idioms with new ones. Let me show you what I'm talking about.

