output/posts/coming-to-terms-with-the-pace-of-change-in-r/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="R is changing rapidly and for the better. Keeping up is worth it.">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Coming to terms with the pace of change in R | Ista Zahn</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://people.fas.harvard.edu/~izahn/posts/coming-to-terms-with-the-pace-of-change-in-r/">
<!--[if lt IE 9]><![endif]--><meta name="description" itemprop="description" content="R is changing rapidly and for the better. Keeping up is worth it.">
<meta name="author" content="Ista Zahn">
<link rel="prev" href="../extracting-content-from-pdf-files/" title="Extracting content from .pdf files" type="text/html">
<link rel="next" href="../resources-for-learning-r/" title="Resources for learning R" type="text/html">
<meta property="og:site_name" content="Ista Zahn">
<meta property="og:title" content="Coming to terms with the pace of change in R">
<meta property="og:url" content="http://people.fas.harvard.edu/~izahn/posts/coming-to-terms-with-the-pace-of-change-in-r/">
<meta property="og:description" content="R is changing rapidly and for the better. Keeping up is worth it.">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2016-09-20T09:58:33-04:00">
<meta property="article:tag" content="R">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://people.fas.harvard.edu/~izahn/">

                <span id="blog-title">Ista Zahn</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../pages/about/">About me</a>
                </li>
<li>
<a href="../../archive/">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Coming to terms with the pace of change in R</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">
                    Ista Zahn
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2016-09-20T09:58:33-04:00" itemprop="datePublished" title="2016-09-20 09:58">2016-09-20 09:58</time></a></p>
                <p class="commentline">
        
        <a href="#isso-thread">Comments</a>


            
        </p>
<p class="sourceline"><a href="index.org" id="sourcelink">Source</a></p>

                <meta name="description" itemprop="description" content="R is changing rapidly and for the better. Keeping up is worth it.">
</div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Is it you or have I become old and cranky?</h2>
<div class="outline-text-2" id="text-1">
<p>
I've been using R and mostly enjoying it since 2006. Lately I've been having some misgivings about the direction R as a community is headed. Some of these misgivings no doubt stem from reluctance to learn new ways of doing things after investing so much time mastering the old ways, but underneath my old-man crankiness I believe there are real and important challenges facing the R community. R has grown considerably since I started using it a decade ago, and this has mostly been a good thing as new packages implement new and better functionality. Recently, popular contributed packages have been replacing core R functionality with new approaches, leading to a fragmentation of the user base and increasing cognitive load by requiring analysts to choose a package (or set of packages) before they even write the first line of code.
</p>

<!-- TEASER_END -->
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R is "a large, coherent, integrated collection of intermediate tools for data analysis"</h2>
<div class="outline-text-2" id="text-2">
<p>
The quote is taken from the official R manual <a href="https://cran.r-project.org/doc/manuals/R-intro.html#Introduction-and-preliminaries">An Introduction to R</a>. The "coherent" and "integrated" claims have always been questionable in some areas, but this situation is getting far worse as contributed packages re-invent basic R features and replace classic R idioms with new ones. Let me show you what I'm talking about.
</p>
</div>
