posts/coming-to-terms-with-the-pace-of-change-in-r.org
** Is there a coherent integrated "group by" in R?
 Suppose I want to aggregate a data set by calculating group sizes, means, and standard deviations. There are many ways to do it in base R, and none are quite satisfactory.

 First up is the =tapply= function. It works well for simple aggregation, but won't help us here because it can only handle a single =x= variable, and it produces confusing return values if =FUN= returns a vector of length greater than one. That is to say, it works fine for calculating a single summary statistic by group
 #+BEGIN_SRC R
   tapply(mtcars$wt, mtcars[c("am", "cyl")],
          FUN = mean)
 #+END_SRC

 #+RESULTS:
 :    cyl
 : am        4       6        8
 :   0 2.93500 3.38875 4.104083
 :   1 2.04225 2.75500 3.370000

 but anything more complicated quickly becomes a mess
 #+BEGIN_SRC R
   tapply(mtcars$wt, mtcars[c("am", "cyl")],
           FUN = function(x) c(n = length(x), mean = mean(x), sd = sd(x)))
 #+END_SRC

 #+RESULTS:
 :    cyl
 : am  4         6         8        
 :   0 Numeric,3 Numeric,3 Numeric,3
 :   1 Numeric,3 Numeric,3 Numeric,3

 Next we might consider the =ave= function, but a quick look at the documentation suggests it won't be any better than =tapply=. OK, let's try something else. Maybe =aggregate= will help us.
 #+BEGIN_SRC R
   aggregate(cbind(mpg, hp, wt) ~ am + cyl,
             data = mtcars,
             FUN = function(x) c(n = length(x), mean = mean(x), sd = sd(x)))
 #+END_SRC

 #+RESULTS:
 :   am cyl      mpg.n   mpg.mean     mpg.sd      hp.n   hp.mean     hp.sd       wt.n    wt.mean      wt.sd
 : 1  0   4  3.0000000 22.9000000  1.4525839   3.00000  84.66667  19.65536  3.0000000  2.9350000  0.4075230
 : 2  1   4  8.0000000 28.0750000  4.4838599   8.00000  81.87500  22.65542  8.0000000  2.0422500  0.4093485
 : 3  0   6  4.0000000 19.1250000  1.6317169   4.00000 115.25000   9.17878  4.0000000  3.3887500  0.1162164
 : 4  1   6  3.0000000 20.5666667  0.7505553   3.00000 131.66667  37.52777  3.0000000  2.7550000  0.1281601
 : 5  0   8 12.0000000 15.0500000  2.7743959  12.00000 194.16667  33.35984 12.0000000  4.1040833  0.7683069
 : 6  1   8  2.0000000 15.4000000  0.5656854   2.00000 299.50000  50.20458  2.0000000  3.3700000  0.2828427

 =aggregate= appears to be closer to what we want than =tapply=, but it still either requires post-processing to remove the redundant group size column, or multiple calls to produce the desired result, e.g.,
 #+BEGIN_SRC R
   merge(aggregate(cbind(n = mpg) ~ am +cyl,
                   data = mtcars,
                   FUN = length),
         aggregate(cbind(mpg, hp, wt) ~ am + cyl,
                   data = mtcars,
                   FUN = function(x) c(mean = mean(x), sd = sd(x))))
 #+END_SRC

 #+RESULTS:
 :   am cyl  n   mpg.mean     mpg.sd   hp.mean     hp.sd   wt.mean     wt.sd
 : 1  0   4  3 22.9000000  1.4525839  84.66667  19.65536 2.9350000 0.4075230
 : 2  0   6  4 19.1250000  1.6317169 115.25000   9.17878 3.3887500 0.1162164
 : 3  0   8 12 15.0500000  2.7743959 194.16667  33.35984 4.1040833 0.7683069
 : 4  1   4  8 28.0750000  4.4838599  81.87500  22.65542 2.0422500 0.4093485
 : 5  1   6  3 20.5666667  0.7505553 131.66667  37.52777 2.7550000 0.1281601
 : 6  1   8  2 15.4000000  0.5656854 299.50000  50.20458 3.3700000 0.2828427

 OK, =tapply= and =ave= were busts, aggregate is close but not quite what we want. How about =by=?

 #+BEGIN_SRC R
   by(mtcars,
      mtcars[c("am", "cyl")],
      FUN = function(x)
      {
        with(x,
             c(n = nrow(x),
               mpg_mean = mean(mpg),
               mpg_sd = sd(mpg),
               hp_mean = mean(hp),
               hp_sd = sd(hp),
               wt_mean = mean(wt),
               wt_sd = sd(wt)))
      },
      simplify = FALSE) 
 #+END_SRC

 #+RESULTS:
 #+begin_example
  am: 0
 cyl: 4
         n  mpg_mean    mpg_sd   hp_mean     hp_sd   wt_mean     wt_sd 
  3.000000 22.900000  1.452584 84.666667 19.655364  2.935000  0.407523 
 ------------------------------------------------------------------------------------- 
 am: 1
 cyl: 4
          n   mpg_mean     mpg_sd    hp_mean      hp_sd    wt_mean      wt_sd 
  8.0000000 28.0750000  4.4838599 81.8750000 22.6554156  2.0422500  0.4093485 
 ------------------------------------------------------------------------------------- 
 am: 0
 cyl: 6
           n    mpg_mean      mpg_sd     hp_mean       hp_sd     wt_mean       wt_sd 
   4.0000000  19.1250000   1.6317169 115.2500000   9.1787799   3.3887500   0.1162164 
 ------------------------------------------------------------------------------------- 
 am: 1
 cyl: 6
           n    mpg_mean      mpg_sd     hp_mean       hp_sd     wt_mean       wt_sd 
   3.0000000  20.5666667   0.7505553 131.6666667  37.5277675   2.7550000   0.1281601 
 ------------------------------------------------------------------------------------- 
 am: 0
 cyl: 8
           n    mpg_mean      mpg_sd     hp_mean       hp_sd     wt_mean       wt_sd 
  12.0000000  15.0500000   2.7743959 194.1666667  33.3598379   4.1040833   0.7683069 
 ------------------------------------------------------------------------------------- 
 am: 1
 cyl: 8
           n    mpg_mean      mpg_sd     hp_mean       hp_sd     wt_mean       wt_sd 
   2.0000000  15.4000000   0.5656854 299.5000000  50.2045815   3.3700000   0.2828427
 #+end_example

 Well, maybe that's better. It's not really any less verbose than the aggregate-and-merge strategy, and the result isn't very friendly. Maybe we should just roll our own.
 #+BEGIN_SRC R
     do.call(rbind,
             lapply(split(mtcars, mtcars[c("am", "cyl")]),
                    function(x) {
                      with(x, 
                           data.frame(am = unique(am),
                                      cyl = unique(cyl),
                                      n = nrow(x),
                                      mpg_mean = mean(mpg),
                                      mpg_sd = sd(mpg),
                                      hp_mean = mean(hp),
                                      hp_sd = sd(hp),
                                      wt_mean = mean(wt),
                                      wt_sd = sd(wt)))
                    }))
 #+END_SRC

 #+RESULTS:
 :     am cyl  n mpg_mean    mpg_sd   hp_mean    hp_sd  wt_mean     wt_sd
 : 0.4  0   4  3 22.90000 1.4525839  84.66667 19.65536 2.935000 0.4075230
 : 1.4  1   4  8 28.07500 4.4838599  81.87500 22.65542 2.042250 0.4093485
 : 0.6  0   6  4 19.12500 1.6317169 115.25000  9.17878 3.388750 0.1162164
 : 1.6  1   6  3 20.56667 0.7505553 131.66667 37.52777 2.755000 0.1281601
 : 0.8  0   8 12 15.05000 2.7743959 194.16667 33.35984 4.104083 0.7683069
 : 1.8  1   8  2 15.40000 0.5656854 299.50000 50.20458 3.370000 0.2828427

 By now we've tried four different approaches, but nothing seems to make the calculation particularly natural or convenient. Is this really a "coherent and integrated" collection of functions? It feels more like a haphazard collection of overlapping functions that can be abused in different ways. So here are some questions. 
 1. Given that =aggregate= appears to be more flexible than =tapply= and =ave=, do we really need the later two?
 2. Can =aggregate= be generalized so that we can apply functions to data.frames instead of to the columns of those data.frames?


