output/posts/coming-to-terms-with-the-pace-of-change-in-r/index.html

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Is there a coherent integrated "group by" in R?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Suppose I want to aggregate a data set by calculating group sizes, means, and standard deviations. There are many ways to do it in base R, and none are quite satisfactory.
</p>

<p>
First up is the <code>tapply</code> function. It works well for simple aggregation, but won't help us here because it can only handle a single <code>x</code> variable, and it produces confusing return values if <code>FUN</code> returns a vector of length greater than one. That is to say, it works fine for calculating a single summary statistic by group
</p>
<div class="highlight"><pre><span></span><span class="kp">tapply</span><span class="p">(</span>mtcars<span class="o">$</span>wt<span class="p">,</span> mtcars<span class="p">[</span><span class="kt">c</span><span class="p">(</span><span class="s">"am"</span><span class="p">,</span> <span class="s">"cyl"</span><span class="p">)],</span>
       FUN <span class="o">=</span> <span class="kp">mean</span><span class="p">)</span>
</pre></div>

<pre class="example">
   cyl
am        4       6        8
  0 2.93500 3.38875 4.104083
  1 2.04225 2.75500 3.370000
</pre>

<p>
but anything more complicated quickly becomes a mess
</p>
<div class="highlight"><pre><span></span><span class="kp">tapply</span><span class="p">(</span>mtcars<span class="o">$</span>wt<span class="p">,</span> mtcars<span class="p">[</span><span class="kt">c</span><span class="p">(</span><span class="s">"am"</span><span class="p">,</span> <span class="s">"cyl"</span><span class="p">)],</span>
	FUN <span class="o">=</span> <span class="kr">function</span><span class="p">(</span>x<span class="p">)</span> <span class="kt">c</span><span class="p">(</span>n <span class="o">=</span> <span class="kp">length</span><span class="p">(</span>x<span class="p">),</span> mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>x<span class="p">),</span> sd <span class="o">=</span> sd<span class="p">(</span>x<span class="p">)))</span>
</pre></div>

<pre class="example">
   cyl
am  4         6         8        
  0 Numeric,3 Numeric,3 Numeric,3
  1 Numeric,3 Numeric,3 Numeric,3
</pre>

<p>
Next we might consider the <code>ave</code> function, but a quick look at the documentation suggests it won't be any better than <code>tapply</code>. OK, let's try something else. Maybe <code>aggregate</code> will help us.
</p>
<div class="highlight"><pre><span></span>aggregate<span class="p">(</span><span class="kp">cbind</span><span class="p">(</span>mpg<span class="p">,</span> hp<span class="p">,</span> wt<span class="p">)</span> <span class="o">~</span> am <span class="o">+</span> cyl<span class="p">,</span>
	  data <span class="o">=</span> mtcars<span class="p">,</span>
	  FUN <span class="o">=</span> <span class="kr">function</span><span class="p">(</span>x<span class="p">)</span> <span class="kt">c</span><span class="p">(</span>n <span class="o">=</span> <span class="kp">length</span><span class="p">(</span>x<span class="p">),</span> mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>x<span class="p">),</span> sd <span class="o">=</span> sd<span class="p">(</span>x<span class="p">)))</span>
</pre></div>

<pre class="example">
  am cyl      mpg.n   mpg.mean     mpg.sd      hp.n   hp.mean     hp.sd       wt.n    wt.mean      wt.sd
1  0   4  3.0000000 22.9000000  1.4525839   3.00000  84.66667  19.65536  3.0000000  2.9350000  0.4075230
2  1   4  8.0000000 28.0750000  4.4838599   8.00000  81.87500  22.65542  8.0000000  2.0422500  0.4093485
3  0   6  4.0000000 19.1250000  1.6317169   4.00000 115.25000   9.17878  4.0000000  3.3887500  0.1162164
4  1   6  3.0000000 20.5666667  0.7505553   3.00000 131.66667  37.52777  3.0000000  2.7550000  0.1281601
5  0   8 12.0000000 15.0500000  2.7743959  12.00000 194.16667  33.35984 12.0000000  4.1040833  0.7683069
6  1   8  2.0000000 15.4000000  0.5656854   2.00000 299.50000  50.20458  2.0000000  3.3700000  0.2828427
</pre>

<p>
<code>aggregate</code> appears to be closer to what we want than <code>tapply</code>, but it still either requires post-processing to remove the redundant group size column, or multiple calls to produce the desired result, e.g.,
</p>
<div class="highlight"><pre><span></span><span class="kp">merge</span><span class="p">(</span>aggregate<span class="p">(</span><span class="kp">cbind</span><span class="p">(</span>n <span class="o">=</span> mpg<span class="p">)</span> <span class="o">~</span> am <span class="o">+</span>cyl<span class="p">,</span>
		data <span class="o">=</span> mtcars<span class="p">,</span>
		FUN <span class="o">=</span> <span class="kp">length</span><span class="p">),</span>
      aggregate<span class="p">(</span><span class="kp">cbind</span><span class="p">(</span>mpg<span class="p">,</span> hp<span class="p">,</span> wt<span class="p">)</span> <span class="o">~</span> am <span class="o">+</span> cyl<span class="p">,</span>
		data <span class="o">=</span> mtcars<span class="p">,</span>
		FUN <span class="o">=</span> <span class="kr">function</span><span class="p">(</span>x<span class="p">)</span> <span class="kt">c</span><span class="p">(</span>mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>x<span class="p">),</span> sd <span class="o">=</span> sd<span class="p">(</span>x<span class="p">))))</span>
</pre></div>

<pre class="example">
  am cyl  n   mpg.mean     mpg.sd   hp.mean     hp.sd   wt.mean     wt.sd
1  0   4  3 22.9000000  1.4525839  84.66667  19.65536 2.9350000 0.4075230
2  0   6  4 19.1250000  1.6317169 115.25000   9.17878 3.3887500 0.1162164
3  0   8 12 15.0500000  2.7743959 194.16667  33.35984 4.1040833 0.7683069
4  1   4  8 28.0750000  4.4838599  81.87500  22.65542 2.0422500 0.4093485
5  1   6  3 20.5666667  0.7505553 131.66667  37.52777 2.7550000 0.1281601
6  1   8  2 15.4000000  0.5656854 299.50000  50.20458 3.3700000 0.2828427
</pre>

<p>
OK, <code>tapply</code> and <code>ave</code> were busts, aggregate is close but not quite what we want. How about <code>by</code>?
</p>

<div class="highlight"><pre><span></span><span class="kp">by</span><span class="p">(</span>mtcars<span class="p">,</span>
   mtcars<span class="p">[</span><span class="kt">c</span><span class="p">(</span><span class="s">"am"</span><span class="p">,</span> <span class="s">"cyl"</span><span class="p">)],</span>
   FUN <span class="o">=</span> <span class="kr">function</span><span class="p">(</span>x<span class="p">)</span>
   <span class="p">{</span>
     <span class="kp">with</span><span class="p">(</span>x<span class="p">,</span>
	  <span class="kt">c</span><span class="p">(</span>n <span class="o">=</span> <span class="kp">nrow</span><span class="p">(</span>x<span class="p">),</span>
	    mpg_mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>mpg<span class="p">),</span>
	    mpg_sd <span class="o">=</span> sd<span class="p">(</span>mpg<span class="p">),</span>
	    hp_mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>hp<span class="p">),</span>
	    hp_sd <span class="o">=</span> sd<span class="p">(</span>hp<span class="p">),</span>
	    wt_mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>wt<span class="p">),</span>
	    wt_sd <span class="o">=</span> sd<span class="p">(</span>wt<span class="p">)))</span>
   <span class="p">},</span>
   simplify <span class="o">=</span> <span class="kc">FALSE</span><span class="p">)</span>
</pre></div>

<pre class="example">
 am: 0
cyl: 4
        n  mpg_mean    mpg_sd   hp_mean     hp_sd   wt_mean     wt_sd 
 3.000000 22.900000  1.452584 84.666667 19.655364  2.935000  0.407523 
------------------------------------------------------------------------------------- 
am: 1
cyl: 4
         n   mpg_mean     mpg_sd    hp_mean      hp_sd    wt_mean      wt_sd 
 8.0000000 28.0750000  4.4838599 81.8750000 22.6554156  2.0422500  0.4093485 
------------------------------------------------------------------------------------- 
am: 0
cyl: 6
          n    mpg_mean      mpg_sd     hp_mean       hp_sd     wt_mean       wt_sd 
  4.0000000  19.1250000   1.6317169 115.2500000   9.1787799   3.3887500   0.1162164 
------------------------------------------------------------------------------------- 
am: 1
cyl: 6
          n    mpg_mean      mpg_sd     hp_mean       hp_sd     wt_mean       wt_sd 
  3.0000000  20.5666667   0.7505553 131.6666667  37.5277675   2.7550000   0.1281601 
------------------------------------------------------------------------------------- 
am: 0
cyl: 8
          n    mpg_mean      mpg_sd     hp_mean       hp_sd     wt_mean       wt_sd 
 12.0000000  15.0500000   2.7743959 194.1666667  33.3598379   4.1040833   0.7683069 
------------------------------------------------------------------------------------- 
am: 1
cyl: 8
          n    mpg_mean      mpg_sd     hp_mean       hp_sd     wt_mean       wt_sd 
  2.0000000  15.4000000   0.5656854 299.5000000  50.2045815   3.3700000   0.2828427
</pre>

<p>
Well, maybe that's better. It's not really any less verbose than the aggregate-and-merge strategy, and the result isn't very friendly. Maybe we should just roll our own.
</p>
<div class="highlight"><pre><span></span><span class="kp">do.call</span><span class="p">(</span><span class="kp">rbind</span><span class="p">,</span>
	<span class="kp">lapply</span><span class="p">(</span><span class="kp">split</span><span class="p">(</span>mtcars<span class="p">,</span> mtcars<span class="p">[</span><span class="kt">c</span><span class="p">(</span><span class="s">"am"</span><span class="p">,</span> <span class="s">"cyl"</span><span class="p">)]),</span>
	       <span class="kr">function</span><span class="p">(</span>x<span class="p">)</span> <span class="p">{</span>
		 <span class="kp">with</span><span class="p">(</span>x<span class="p">,</span> 
		      <span class="kt">data.frame</span><span class="p">(</span>am <span class="o">=</span> <span class="kp">unique</span><span class="p">(</span>am<span class="p">),</span>
				 cyl <span class="o">=</span> <span class="kp">unique</span><span class="p">(</span>cyl<span class="p">),</span>
				 n <span class="o">=</span> <span class="kp">nrow</span><span class="p">(</span>x<span class="p">),</span>
				 mpg_mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>mpg<span class="p">),</span>
				 mpg_sd <span class="o">=</span> sd<span class="p">(</span>mpg<span class="p">),</span>
				 hp_mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>hp<span class="p">),</span>
				 hp_sd <span class="o">=</span> sd<span class="p">(</span>hp<span class="p">),</span>
				 wt_mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>wt<span class="p">),</span>
				 wt_sd <span class="o">=</span> sd<span class="p">(</span>wt<span class="p">)))</span>
	       <span class="p">}))</span>
</pre></div>

<pre class="example">
    am cyl  n mpg_mean    mpg_sd   hp_mean    hp_sd  wt_mean     wt_sd
0.4  0   4  3 22.90000 1.4525839  84.66667 19.65536 2.935000 0.4075230
1.4  1   4  8 28.07500 4.4838599  81.87500 22.65542 2.042250 0.4093485
0.6  0   6  4 19.12500 1.6317169 115.25000  9.17878 3.388750 0.1162164
1.6  1   6  3 20.56667 0.7505553 131.66667 37.52777 2.755000 0.1281601
0.8  0   8 12 15.05000 2.7743959 194.16667 33.35984 4.104083 0.7683069
1.8  1   8  2 15.40000 0.5656854 299.50000 50.20458 3.370000 0.2828427
</pre>

<p>
By now we've tried four different approaches, but nothing seems to make the calculation particularly natural or convenient. Is this really a "coherent and integrated" collection of functions? It feels more like a haphazard collection of overlapping functions that can be abused in different ways. So here are some questions. 
</p>
<ol class="org-ol">
<li>Given that <code>aggregate</code> appears to be more flexible than <code>tapply</code> and <code>ave</code>, do we really need the later two?
</li>
<li>Can <code>aggregate</code> be generalized so that we can apply functions to data.frames instead of to the columns of those data.frames?
</li>
</ol>
</div>
</div>
