posts/coming-to-terms-with-the-pace-of-change-in-r.org
** Can we do better?
 Of course we can do better. Many an R programmer has gazed out over the rubble of =tapply=, =ave=, =by= and =aggregate= and mused "surely I can bring order and harmony to this jumble. Follow me and we will create a 'group by' operation to end all SQL jealousy in the kingdom of R." And what comes of this musing? Let us look with wonder upon the bubbling exuberant creativity of the R community.

*** doBy::describeBy
 Very similar to =aggregate=, same limitations.
 #+BEGIN_SRC R
   doBy::summaryBy(mpg + hp + wt ~ am + cyl,
                   data = mtcars,
                   FUN = function(x) c(n = length(x), mean = mean(x), sd = sd(x)))
 #+END_SRC

 #+RESULTS:
 :   am cyl mpg.n mpg.mean    mpg.sd hp.n   hp.mean    hp.sd wt.n  wt.mean     wt.sd
 : 1  0   4     3 22.90000 1.4525839    3  84.66667 19.65536    3 2.935000 0.4075230
 : 2  0   6     4 19.12500 1.6317169    4 115.25000  9.17878    4 3.388750 0.1162164
 : 3  0   8    12 15.05000 2.7743959   12 194.16667 33.35984   12 4.104083 0.7683069
 : 4  1   4     8 28.07500 4.4838599    8  81.87500 22.65542    8 2.042250 0.4093485
 : 5  1   6     3 20.56667 0.7505553    3 131.66667 37.52777    3 2.755000 0.1281601
 : 6  1   8     2 15.40000 0.5656854    2 299.50000 50.20458    2 3.370000 0.2828427

*** Hmisc::summary.formula
 Similar to aggregate, large number of confusing options. This one automatically computes N for each group, so it actually works for our example.
 #+BEGIN_SRC R
   Hmisc::summary.formula(cbind(mpg, hp, wt) ~ am + cyl,
                          data = mtcars,
                          fun = function(x) {
                            apply(x,
                                  2,
                                  FUN = function(y) {
                                    c(mean = mean(y), sd = sd(y))
                                  })
                          })
 #+END_SRC

 #+RESULTS:
 #+begin_example
  cbind(mpg, hp, wt)    N=32

 +-------+---+--+--------+--------+---------+--------+--------+---------+
 |       |   |N |mpg mean|mpg sd  |hp mean  |hp sd   |wt mean |wt sd    |
 +-------+---+--+--------+--------+---------+--------+--------+---------+
 |am     |No |19|17.14737|3.833966|160.26316|53.90820|3.768895|0.7774001|
 |       |Yes|13|24.39231|6.166504|126.84615|84.06232|2.411000|0.6169816|
 +-------+---+--+--------+--------+---------+--------+--------+---------+
 |cyl    |4  |11|26.66364|4.509828| 82.63636|20.93453|2.285727|0.5695637|
 |       |6  | 7|19.74286|1.453567|122.28571|24.26049|3.117143|0.3563455|
 |       |8  |14|15.10000|2.560048|209.21429|50.97689|3.999214|0.7594047|
 +-------+---+--+--------+--------+---------+--------+--------+---------+
 |Overall|   |32|20.09062|6.026948|146.68750|68.56287|3.217250|0.9784574|
 +-------+---+--+--------+--------+---------+--------+--------+---------+
 #+end_example

*** dplyr::summarize
 This one is very popular, and for good reason. It works well.
 #+BEGIN_SRC R
   dplyr::summarize(dplyr::group_by(mtcars, am, cyl),
                    n = length(mpg),
                    mean_mpg = mean(mpg),
                    sd_mpg = sd(mpg),
                    mean_hp = mean(hp),
                    sd_hp = sd(hp),
                    mean_wt = mean(wt),
                    sd_hp = sd(hp))
 #+END_SRC

 #+RESULTS:
 #+begin_example
  Source: local data frame [6 x 8]
 Groups: am [?]

      am   cyl     n mean_mpg    sd_mpg   mean_hp    sd_hp  mean_wt
   <dbl> <dbl> <int>    <dbl>     <dbl>     <dbl>    <dbl>    <dbl>
 1     0     4     3 22.90000 1.4525839  84.66667 19.65536 2.935000
 2     0     6     4 19.12500 1.6317169 115.25000  9.17878 3.388750
 3     0     8    12 15.05000 2.7743959 194.16667 33.35984 4.104083
 4     1     4     8 28.07500 4.4838599  81.87500 22.65542 2.042250
 5     1     6     3 20.56667 0.7505553 131.66667 37.52777 2.755000
 6     1     8     2 15.40000 0.5656854 299.50000 50.20458 3.370000
 #+end_example

*** dplyr::do
 If you have a large number of columns to summarize you might not want to type them all out. In that case you can use =do=.
 #+BEGIN_SRC R
   do(group_by(mtcars, am, cyl),
      as.data.frame(c(list(n = ncol(.)),
                      as.list(sapply(.[c("mpg", "wt", "hp")],
                                     function(x) c(mean = mean(x)))),
                      as.list(sapply(.[c("mpg", "wt", "hp")],
                                     function(x) c(sd = mean(x)))))))
 #+END_SRC

 #+RESULTS:
 #+begin_example
  Source: local data frame [6 x 9]
 Groups: am, cyl [6]

      am   cyl     n mpg.mean  wt.mean   hp.mean   mpg.sd    wt.sd     hp.sd
   <dbl> <dbl> <int>    <dbl>    <dbl>     <dbl>    <dbl>    <dbl>     <dbl>
 1     0     4    11 22.90000 2.935000  84.66667 22.90000 2.935000  84.66667
 2     0     6    11 19.12500 3.388750 115.25000 19.12500 3.388750 115.25000
 3     0     8    11 15.05000 4.104083 194.16667 15.05000 4.104083 194.16667
 4     1     4    11 28.07500 2.042250  81.87500 28.07500 2.042250  81.87500
 5     1     6    11 20.56667 2.755000 131.66667 20.56667 2.755000 131.66667
 6     1     8    11 15.40000 3.370000 299.50000 15.40000 3.370000 299.50000
 #+end_example

