output/posts/coming-to-terms-with-the-pace-of-change-in-r/index.html


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Can we do better?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Of course we can do better. Many an R programmer has gazed out over the rubble of <code>tapply</code>, <code>ave</code>, <code>by</code> and <code>aggregate</code> and mused "surely I can bring order and harmony to this jumble. Follow me and we will create a 'group by' operation to end all SQL jealousy in the kingdom of R." And what comes of this musing? Let us look with wonder upon the bubbling exuberant creativity of the R community.
</p>
</div>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">doBy::describeBy</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Very similar to <code>aggregate</code>, same limitations.
</p>
<div class="highlight"><pre><span></span>doBy<span class="o">::</span>summaryBy<span class="p">(</span>mpg <span class="o">+</span> hp <span class="o">+</span> wt <span class="o">~</span> am <span class="o">+</span> cyl<span class="p">,</span>
		data <span class="o">=</span> mtcars<span class="p">,</span>
		FUN <span class="o">=</span> <span class="kr">function</span><span class="p">(</span>x<span class="p">)</span> <span class="kt">c</span><span class="p">(</span>n <span class="o">=</span> <span class="kp">length</span><span class="p">(</span>x<span class="p">),</span> mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>x<span class="p">),</span> sd <span class="o">=</span> sd<span class="p">(</span>x<span class="p">)))</span>
</pre></div>

<pre class="example">
  am cyl mpg.n mpg.mean    mpg.sd hp.n   hp.mean    hp.sd wt.n  wt.mean     wt.sd
1  0   4     3 22.90000 1.4525839    3  84.66667 19.65536    3 2.935000 0.4075230
2  0   6     4 19.12500 1.6317169    4 115.25000  9.17878    4 3.388750 0.1162164
3  0   8    12 15.05000 2.7743959   12 194.16667 33.35984   12 4.104083 0.7683069
4  1   4     8 28.07500 4.4838599    8  81.87500 22.65542    8 2.042250 0.4093485
5  1   6     3 20.56667 0.7505553    3 131.66667 37.52777    3 2.755000 0.1281601
6  1   8     2 15.40000 0.5656854    2 299.50000 50.20458    2 3.370000 0.2828427
</pre>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">Hmisc::summary.formula</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Similar to aggregate, large number of confusing options. This one automatically computes N for each group, so it actually works for our example.
</p>
<div class="highlight"><pre><span></span>Hmisc<span class="o">::</span>summary.formula<span class="p">(</span><span class="kp">cbind</span><span class="p">(</span>mpg<span class="p">,</span> hp<span class="p">,</span> wt<span class="p">)</span> <span class="o">~</span> am <span class="o">+</span> cyl<span class="p">,</span>
		       data <span class="o">=</span> mtcars<span class="p">,</span>
		       fun <span class="o">=</span> <span class="kr">function</span><span class="p">(</span>x<span class="p">)</span> <span class="p">{</span>
			 <span class="kp">apply</span><span class="p">(</span>x<span class="p">,</span>
			       <span class="m">2</span><span class="p">,</span>
			       FUN <span class="o">=</span> <span class="kr">function</span><span class="p">(</span>y<span class="p">)</span> <span class="p">{</span>
				 <span class="kt">c</span><span class="p">(</span>mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>y<span class="p">),</span> sd <span class="o">=</span> sd<span class="p">(</span>y<span class="p">))</span>
			       <span class="p">})</span>
		       <span class="p">})</span>
</pre></div>

<pre class="example">
 cbind(mpg, hp, wt)    N=32

+-------+---+--+--------+--------+---------+--------+--------+---------+
|       |   |N |mpg mean|mpg sd  |hp mean  |hp sd   |wt mean |wt sd    |
+-------+---+--+--------+--------+---------+--------+--------+---------+
|am     |No |19|17.14737|3.833966|160.26316|53.90820|3.768895|0.7774001|
|       |Yes|13|24.39231|6.166504|126.84615|84.06232|2.411000|0.6169816|
+-------+---+--+--------+--------+---------+--------+--------+---------+
|cyl    |4  |11|26.66364|4.509828| 82.63636|20.93453|2.285727|0.5695637|
|       |6  | 7|19.74286|1.453567|122.28571|24.26049|3.117143|0.3563455|
|       |8  |14|15.10000|2.560048|209.21429|50.97689|3.999214|0.7594047|
+-------+---+--+--------+--------+---------+--------+--------+---------+
|Overall|   |32|20.09062|6.026948|146.68750|68.56287|3.217250|0.9784574|
+-------+---+--+--------+--------+---------+--------+--------+---------+
</pre>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3">dplyr::summarize</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
This one is very popular, and for good reason. It works well.
</p>
<div class="highlight"><pre><span></span>dplyr<span class="o">::</span>summarize<span class="p">(</span>dplyr<span class="o">::</span>group_by<span class="p">(</span>mtcars<span class="p">,</span> am<span class="p">,</span> cyl<span class="p">),</span>
		 n <span class="o">=</span> <span class="kp">length</span><span class="p">(</span>mpg<span class="p">),</span>
		 mean_mpg <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>mpg<span class="p">),</span>
		 sd_mpg <span class="o">=</span> sd<span class="p">(</span>mpg<span class="p">),</span>
		 mean_hp <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>hp<span class="p">),</span>
		 sd_hp <span class="o">=</span> sd<span class="p">(</span>hp<span class="p">),</span>
		 mean_wt <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>wt<span class="p">),</span>
		 sd_hp <span class="o">=</span> sd<span class="p">(</span>hp<span class="p">))</span>
</pre></div>

<pre class="example">
 Source: local data frame [6 x 8]
Groups: am [?]

     am   cyl     n mean_mpg    sd_mpg   mean_hp    sd_hp  mean_wt
  &lt;dbl&gt; &lt;dbl&gt; &lt;int&gt;    &lt;dbl&gt;     &lt;dbl&gt;     &lt;dbl&gt;    &lt;dbl&gt;    &lt;dbl&gt;
1     0     4     3 22.90000 1.4525839  84.66667 19.65536 2.935000
2     0     6     4 19.12500 1.6317169 115.25000  9.17878 3.388750
3     0     8    12 15.05000 2.7743959 194.16667 33.35984 4.104083
4     1     4     8 28.07500 4.4838599  81.87500 22.65542 2.042250
5     1     6     3 20.56667 0.7505553 131.66667 37.52777 2.755000
6     1     8     2 15.40000 0.5656854 299.50000 50.20458 3.370000
</pre>
</div>
</div>

<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4">dplyr::do</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
If you have a large number of columns to summarize you might not want to type them all out. In that case you can use <code>do</code>.
</p>
<div class="highlight"><pre><span></span>do<span class="p">(</span>group_by<span class="p">(</span>mtcars<span class="p">,</span> am<span class="p">,</span> cyl<span class="p">),</span>
   <span class="kp">as.data.frame</span><span class="p">(</span><span class="kt">c</span><span class="p">(</span><span class="kt">list</span><span class="p">(</span>n <span class="o">=</span> <span class="kp">ncol</span><span class="p">(</span><span class="m">.</span><span class="p">)),</span>
		   <span class="kp">as.list</span><span class="p">(</span><span class="kp">sapply</span><span class="p">(</span><span class="m">.</span><span class="p">[</span><span class="kt">c</span><span class="p">(</span><span class="s">"mpg"</span><span class="p">,</span> <span class="s">"wt"</span><span class="p">,</span> <span class="s">"hp"</span><span class="p">)],</span>
				  <span class="kr">function</span><span class="p">(</span>x<span class="p">)</span> <span class="kt">c</span><span class="p">(</span>mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>x<span class="p">)))),</span>
		   <span class="kp">as.list</span><span class="p">(</span><span class="kp">sapply</span><span class="p">(</span><span class="m">.</span><span class="p">[</span><span class="kt">c</span><span class="p">(</span><span class="s">"mpg"</span><span class="p">,</span> <span class="s">"wt"</span><span class="p">,</span> <span class="s">"hp"</span><span class="p">)],</span>
				  <span class="kr">function</span><span class="p">(</span>x<span class="p">)</span> <span class="kt">c</span><span class="p">(</span>sd <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>x<span class="p">)))))))</span>
</pre></div>

<pre class="example">
 Source: local data frame [6 x 9]
Groups: am, cyl [6]

     am   cyl     n mpg.mean  wt.mean   hp.mean   mpg.sd    wt.sd     hp.sd
  &lt;dbl&gt; &lt;dbl&gt; &lt;int&gt;    &lt;dbl&gt;    &lt;dbl&gt;     &lt;dbl&gt;    &lt;dbl&gt;    &lt;dbl&gt;     &lt;dbl&gt;
1     0     4    11 22.90000 2.935000  84.66667 22.90000 2.935000  84.66667
2     0     6    11 19.12500 3.388750 115.25000 19.12500 3.388750 115.25000
3     0     8    11 15.05000 4.104083 194.16667 15.05000 4.104083 194.16667
4     1     4    11 28.07500 2.042250  81.87500 28.07500 2.042250  81.87500
5     1     6    11 20.56667 2.755000 131.66667 20.56667 2.755000 131.66667
6     1     8    11 15.40000 3.370000 299.50000 15.40000 3.370000 299.50000
</pre>
</div>
</div>
