posts/coming-to-terms-with-the-pace-of-change-in-r.org
*** tables::tabular
 This one focuses on creating LaTeX and HTML tables. It creates its own SAS-inspired mini-language that is IMO very confusing, though possibly worth it if you frequently need to create complex publication ready tables.
 #+BEGIN_SRC R
   #library(tables)
   tables::tabular((Factor(am))*(Factor(cyl)) ~ (n = 1) + (mpg + wt + hp)*(mean + sd), data = mtcars)  
 #+END_SRC

 #+RESULTS:
 :                                                   
 :            mpg          wt           hp           
 :  am cyl n  mean  sd     mean  sd     mean   sd    
 :  0  4    3 22.90 1.4526 2.935 0.4075  84.67 19.655
 :     6    4 19.12 1.6317 3.389 0.1162 115.25  9.179
 :     8   12 15.05 2.7744 4.104 0.7683 194.17 33.360
 :  1  4    8 28.07 4.4839 2.042 0.4093  81.88 22.655
 :     6    3 20.57 0.7506 2.755 0.1282 131.67 37.528
 :     8    2 15.40 0.5657 3.370 0.2828 299.50 50.205

*** data.table::`[`
 The data.table package implements an alternative to the venerable =data.frame= class in R and provides sophisticated manipulation via an indexing-like interface.
 #+BEGIN_SRC R
   as.data.table(mtcars)[,
                         list(n = .N,
                              mpg_mean = mean(mpg),
                              mpg_sd = sd(mpg),
                              wt_mean = mean(wt),
                              wt_sd = sd(wt),
                              hp_mean = mean(hp),
                              hp_sd = sd(hp)),
                         by = c("am", "cyl")]                           
 #+END_SRC

 Are we done yet? Well, I'm going to stop, but we could go on. There are at least 9 ways to skin this particular cat in R. 

** How do I ___ in R?
 So there are lots of ways to calculate statistics by some grouping variable(s) in R. Why can't you be happy that you have so many excellent choices?

 I can't be happy about it because it makes my life more difficult. First, I need to identify my options. Then I need to evaluate them, and learn the particulars of my chosen package. This all takes effort that I would rather spend on other things. Now, if this problem was limited to the domain of calculating statistics by group, I wouldn't be writing this post. But this issue is almost everywhere in R.

*** How do I read text data?
 I have a .csv file I want to read into R. Should I use
 - read.csv
 - readr::read_csv
 - data.table::fread
 - rio::import
 - hypoparsr::parse_file
 - cvsread::cvsread
 or something else?

*** How do I fit a linear regression model?

 I want to fit a simple linear regression model. Should I use
 - lm
 - rms::ols
 - Zelig::zlm
 - glm2::glm2
 or something else?

*** How do I make a table from model coefficients?
 I've fit a model and would like to put the results in a nice table. Should I use
 - xtable::xtable
 - rockchalk::outreg
 - apsrtable::apsrtable
 - htmlTable::htmlTable
 - etable::tabular.ade
 - knitr::ktable
 - texreg::texreg
 - stargazer::stargazer
 - ascii::ascii
 - estout::esttab
 or some other thing?

** TODO Summary [summarize the post thus far]
There is an overwhelming number of choices for doing just about anything in R.

* What is R really?
OK, so there is some duplication among R functions and packages and people need to choose. There are both good and bad consequences of this, but the totality of the situation is that *it is no longer clear what R is*.

** R is not data.frames
 Most people who use R use it for statistical analysis and graphics. The basic data structure in most popular statistical package is a rectangular structure with variables in the columns and observations in the rows. In R this structure is called a =data.frame= and learning how to operate on and with data.frames is a basic skill that any R user must have.

 The previous sentence may have been true at one time, but it no longer is. There are now at least three popular alternatives; =data.frame=, =data.table= and =tibble=. It is now possible to carry out sophisticated data manipulation and analysis in R without ever learning fundamental =data.frame= methods such as `[.data.frame`. All of these methods work differently.
#+BEGIN_SRC R
  head(mtcars)[, 1]
#+END_SRC  

#+RESULTS:
: [1] 21.0 21.0 22.8 21.4 18.7 18.1

#+BEGIN_SRC R
  as.data.table(head(mtcars))[, 1]
#+END_SRC  

#+RESULTS:
: [1] 1

#+BEGIN_SRC R
  as_tibble(head(mtcars))[, 1]
#+END_SRC  

#+RESULTS:
: # A tibble: 6 × 1
:     mpg
:   <dbl>
: 1  21.0
: 2  21.0
: 3  22.8
: 4  21.4
: 5  18.7
: 6  18.1

** R is not a language that uses parenthetical argument lists, like c
One of the first things I used to teach people about R is that function calls have the form =functionName(arg1, arg2, ..., argn)=, and that even when all arguments are optional and you want to accept the defaults you need the =()= after the function name. This is no longer true. Many people now write strange looking R expressions like
#+BEGIN_SRC R
  library(magrittr)
  mtcars %>% head
#+END_SRC

R has always had flexible syntax, but with developments like this you can write R that looks nothing like what us old-timers expect R code to be.

** R is not coherent
There is no [[https://www.python.org/dev/peps/pep-0020/#the-zen-of-python][zen-like "one obvious way to do it"]] it R. 

** R is being built phoenix-like from its own ashes
There is good news and there is bad news. The good news is that new and more coherent and integrated zones are being carved out of the R landscape. For example, the [[https://blog.rstudio.org/2016/09/15/tidyverse-1-0-0/][tidyverse]] brings greater simplicity and constancy to many common operations in R. The bad news is that you can't escape the cold hard [[http://xkcd.com/927/][XKCD reality]] that producing a "better" way of doing things means there is _one more_ way of doing that thing. 

