output/posts/coming-to-terms-with-the-pace-of-change-in-r/index.html

<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5">tables::tabular</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
This one focuses on creating LaTeX and HTML tables. It creates its own SAS-inspired mini-language that is IMO very confusing, though possibly worth it if you frequently need to create complex publication ready tables.
</p>
<div class="highlight"><pre><span></span><span class="c1">#library(tables)</span>
tables<span class="o">::</span>tabular<span class="p">((</span>Factor<span class="p">(</span>am<span class="p">))</span><span class="o">*</span><span class="p">(</span>Factor<span class="p">(</span>cyl<span class="p">))</span> <span class="o">~</span> <span class="p">(</span>n <span class="o">=</span> <span class="m">1</span><span class="p">)</span> <span class="o">+</span> <span class="p">(</span>mpg <span class="o">+</span> wt <span class="o">+</span> hp<span class="p">)</span><span class="o">*</span><span class="p">(</span>mean <span class="o">+</span> sd<span class="p">),</span> data <span class="o">=</span> mtcars<span class="p">)</span>
</pre></div>

<pre class="example">
                                                 
          mpg          wt           hp           
am cyl n  mean  sd     mean  sd     mean   sd    
0  4    3 22.90 1.4526 2.935 0.4075  84.67 19.655
   6    4 19.12 1.6317 3.389 0.1162 115.25  9.179
   8   12 15.05 2.7744 4.104 0.7683 194.17 33.360
1  4    8 28.07 4.4839 2.042 0.4093  81.88 22.655
   6    3 20.57 0.7506 2.755 0.1282 131.67 37.528
   8    2 15.40 0.5657 3.370 0.2828 299.50 50.205
</pre>
</div>
</div>

<div id="outline-container-sec-2-2-6" class="outline-4">
<h4 id="sec-2-2-6">data.table::`[`</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
The data.table package implements an alternative to the venerable <code>data.frame</code> class in R and provides sophisticated manipulation via an indexing-like interface.
</p>
<div class="highlight"><pre><span></span>as.data.table<span class="p">(</span>mtcars<span class="p">)[,</span>
		      <span class="kt">list</span><span class="p">(</span>n <span class="o">=</span> <span class="m">.</span>N<span class="p">,</span>
			   mpg_mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>mpg<span class="p">),</span>
			   mpg_sd <span class="o">=</span> sd<span class="p">(</span>mpg<span class="p">),</span>
			   wt_mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>wt<span class="p">),</span>
			   wt_sd <span class="o">=</span> sd<span class="p">(</span>wt<span class="p">),</span>
			   hp_mean <span class="o">=</span> <span class="kp">mean</span><span class="p">(</span>hp<span class="p">),</span>
			   hp_sd <span class="o">=</span> sd<span class="p">(</span>hp<span class="p">)),</span>
		      by <span class="o">=</span> <span class="kt">c</span><span class="p">(</span><span class="s">"am"</span><span class="p">,</span> <span class="s">"cyl"</span><span class="p">)]</span>
</pre></div>

<p>
Are we done yet? Well, I'm going to stop, but we could go on. There are at least 9 ways to skin this particular cat in R. 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">How do I <span class="underline">_</span> in R?</h3>
<div class="outline-text-3" id="text-2-3">
<p>
So there are lots of ways to calculate statistics by some grouping variable(s) in R. Why can't you be happy that you have so many excellent choices?
</p>

<p>
I can't be happy about it because it makes my life more difficult. First, I need to identify my options. Then I need to evaluate them, and learn the particulars of my chosen package. This all takes effort that I would rather spend on other things. Now, if this problem was limited to the domain of calculating statistics by group, I wouldn't be writing this post. But this issue is almost everywhere in R.
</p>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">How do I read text data?</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
I have a .csv file I want to read into R. Should I use
</p>
<ul class="org-ul">
<li>read.csv
</li>
<li>readr::read<sub>csv</sub>
</li>
<li>data.table::fread
</li>
<li>rio::import
</li>
<li>hypoparsr::parse<sub>file</sub>
</li>
<li>cvsread::cvsread
</li>
</ul>
<p>
or something else?
</p>
</div>
</div>

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2">How do I fit a linear regression model?</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
I want to fit a simple linear regression model. Should I use
</p>
<ul class="org-ul">
<li>lm
</li>
<li>rms::ols
</li>
<li>Zelig::zlm
</li>
<li>glm2::glm2
</li>
</ul>
<p>
or something else?
</p>
</div>
</div>

<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3">How do I make a table from model coefficients?</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
I've fit a model and would like to put the results in a nice table. Should I use
</p>
<ul class="org-ul">
<li>xtable::xtable
</li>
<li>rockchalk::outreg
</li>
<li>apsrtable::apsrtable
</li>
<li>htmlTable::htmlTable
</li>
<li>etable::tabular.ade
</li>
<li>knitr::ktable
</li>
<li>texreg::texreg
</li>
<li>stargazer::stargazer
</li>
<li>ascii::ascii
</li>
<li>estout::esttab
</li>
</ul>
<p>
or some other thing?
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">
<span class="todo TODO">TODO</span> Summary [summarize the post thus far]</h3>
<div class="outline-text-3" id="text-2-4">
<p>
There is an overwhelming number of choices for doing just about anything in R.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">What is R really?</h2>
<div class="outline-text-2" id="text-3">
<p>
OK, so there is some duplication among R functions and packages and people need to choose. There are both good and bad consequences of this, but the totality of the situation is that <b>it is no longer clear what R is</b>.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">R is not data.frames</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Most people who use R use it for statistical analysis and graphics. The basic data structure in most popular statistical package is a rectangular structure with variables in the columns and observations in the rows. In R this structure is called a <code>data.frame</code> and learning how to operate on and with data.frames is a basic skill that any R user must have.
</p>

<p>
The previous sentence may have been true at one time, but it no longer is. There are now at least three popular alternatives; <code>data.frame</code>, <code>data.table</code> and <code>tibble</code>. It is now possible to carry out sophisticated data manipulation and analysis in R without ever learning fundamental <code>data.frame</code> methods such as `[.data.frame`. All of these methods work differently.
</p>
<div class="highlight"><pre><span></span><span class="kp">head</span><span class="p">(</span>mtcars<span class="p">)[,</span> <span class="m">1</span><span class="p">]</span>
</pre></div>

<pre class="example">
[1] 21.0 21.0 22.8 21.4 18.7 18.1
</pre>

<div class="highlight"><pre><span></span>as.data.table<span class="p">(</span><span class="kp">head</span><span class="p">(</span>mtcars<span class="p">))[,</span> <span class="m">1</span><span class="p">]</span>
</pre></div>

<pre class="example">
[1] 1
</pre>

<div class="highlight"><pre><span></span>as_tibble<span class="p">(</span><span class="kp">head</span><span class="p">(</span>mtcars<span class="p">))[,</span> <span class="m">1</span><span class="p">]</span>
</pre></div>

<pre class="example">
# A tibble: 6 × 1
    mpg
  &lt;dbl&gt;
1  21.0
2  21.0
3  22.8
4  21.4
5  18.7
6  18.1
</pre>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">R is not a language that uses parenthetical argument lists, like c</h3>
<div class="outline-text-3" id="text-3-2">
<p>
One of the first things I used to teach people about R is that function calls have the form <code>functionName(arg1, arg2, ..., argn)</code>, and that even when all arguments are optional and you want to accept the defaults you need the <code>()</code> after the function name. This is no longer true. Many people now write strange looking R expressions like
</p>
<div class="highlight"><pre><span></span><span class="kn">library</span><span class="p">(</span>magrittr<span class="p">)</span>
mtcars <span class="o">%&gt;%</span> <span class="kp">head</span>
</pre></div>

<p>
R has always had flexible syntax, but with developments like this you can write R that looks nothing like what us old-timers expect R code to be.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">R is not coherent</h3>
<div class="outline-text-3" id="text-3-3">
<p>
There is no <a href="https://www.python.org/dev/peps/pep-0020/#the-zen-of-python">zen-like "one obvious way to do it"</a> it R. 
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">R is being built phoenix-like from its own ashes</h3>
<div class="outline-text-3" id="text-3-4">
<p>
There is good news and there is bad news. The good news is that new and more coherent and integrated zones are being carved out of the R landscape. For example, the <a href="https://blog.rstudio.org/2016/09/15/tidyverse-1-0-0/">tidyverse</a> brings greater simplicity and constancy to many common operations in R. The bad news is that you can't escape the cold hard <a href="http://xkcd.com/927/">XKCD reality</a> that producing a "better" way of doing things means there is <span class="underline">one more</span> way of doing that thing. 
</p>
</div>
</div>
</div>
